In [1]:
import pandas as pd

In [2]:
a = ["Aaqib", "Danish", "Nazish", "Nicey"]
b = ['M', 'M','M','F']

In [3]:
df = pd.DataFrame({"Name":a,"Gender":b})

In [4]:
df.head()

     Name Gender
0   Aaqib      M
1  Danish      M
2  Nazish      M
3   Nicey      F

In [5]:
df['Age'] = [20, 29, 25, 23]

In [6]:
df.head()

     Name Gender  Age
0   Aaqib      M   20
1  Danish      M   29
2  Nazish      M   25
3   Nicey      F   23

In [7]:
df.Age

0    20
1    29
2    25
3    23
Name: Age, dtype: int64

In [10]:
df.Age = df.Age /2

In [15]:
df_drop = df.drop('Age', axis = 1)

In [17]:
df_drop

     Name Gender
0   Aaqib      M
1  Danish      M
2  Nazish      M
3   Nicey      F

In [20]:
df_drop.drop(range(2), axis = 0)

     Name Gender
2  Nazish      M
3   Nicey      F

In [44]:
df

     Name Gender   Age
0   Aaqib      M  20.0
1  Danish      M  29.0
2  Nazish      M  25.0
3   Nicey      F  23.0

In [45]:
df_comb = pd.concat([df,df],axis = 0)

In [46]:
df_comb

     Name Gender   Age
0   Aaqib      M  20.0
1  Danish      M  29.0
2  Nazish      M  25.0
3   Nicey      F  23.0
0   Aaqib      M  20.0
1  Danish      M  29.0
2  Nazish      M  25.0
3   Nicey      F  23.0

In [47]:
df_comb.reset_index(inplace = True, drop = True)

In [48]:
df_comb

     Name Gender   Age
0   Aaqib      M  20.0
1  Danish      M  29.0
2  Nazish      M  25.0
3   Nicey      F  23.0
4   Aaqib      M  20.0
5  Danish      M  29.0
6  Nazish      M  25.0
7   Nicey      F  23.0

In [49]:
df

     Name Gender   Age
0   Aaqib      M  20.0
1  Danish      M  29.0
2  Nazish      M  25.0
3   Nicey      F  23.0

In [77]:
df.set_index('Name', inplace = True)

In [78]:
# df.reset_index(inplace = True)

In [79]:
df

       Gender   Age
Name
Aaqib       M  20.0
Danish      M  29.0
Nazish      M  25.0
Nicey       F  23.0

In [66]:
df_trans = pd.DataFrame({'Name':['Danish','Danish','Nazish','Nazish'],'Amount':[2000,40000,3000,7000]})

In [80]:
df_trans.set_index('Name', inplace = True)

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Aaqib to Nicey
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Gender  4 non-null      object
 1   Age     4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 96.0+ bytes

In [82]:
df_trans

        Amount
Name
Danish    2000
Danish   40000
Nazish    3000
Nazish    7000

In [75]:
df_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Amount  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [91]:
df_join = df.join(df_trans)

In [93]:
df_join.reset_index(inplace = True)

In [94]:
df_join

     Name Gender   Age   Amount
0   Aaqib      M  20.0      NaN
1  Danish      M  29.0   2000.0
2  Danish      M  29.0  40000.0
3  Nazish      M  25.0   3000.0
4  Nazish      M  25.0   7000.0
5   Nicey      F  23.0      NaN

In [115]:
df_grp = df_join.groupby(['Gender','Name'], as_index = False).agg({"Amount":"sum","Age":"first"})

In [116]:
df_grp

  Gender    Name   Amount   Age
0      F   Nicey      0.0  23.0
1      M   Aaqib      0.0  20.0
2      M  Danish  42000.0  29.0
3      M  Nazish  10000.0  25.0

In [118]:
df_grp.sort_values('Amount', ascending = False)

  Gender    Name   Amount   Age
2      M  Danish  42000.0  29.0
3      M  Nazish  10000.0  25.0
0      F   Nicey      0.0  23.0
1      M   Aaqib      0.0  20.0

In [120]:
df_grp.loc[2:5]

  Gender    Name   Amount   Age
2      M  Danish  42000.0  29.0
3      M  Nazish  10000.0  25.0